{
    "description": "We’re going to make a Fish Chomp game! Guide the large Hungry Fish and try to eat all the prey that are swimming around.", 
    "image": "https://raw.githubusercontent.com/CodeClub/scratch-curriculum/master/en-GB/Archived%20Projects/Fish%20Chomp/fishchomp_screenshot.png", 
    "name": "fish_chomp", 
    "number": 21, 
    "show": false, 
    "steps": [
        {
            "components": [
                {
                    "text": "+ Start a new Scratch project."
                }, 
                {
                    "text": "Select the Stage, then select the Stage’s Backdrop tab. Import the background **Nature/underwater3** using `choose background from library`. Finally, remove **backdrop1**."
                }, 
                {
                    "text": "Change the name of Sprite1 to **Hungry Fish** by clicking on the blue `i` symbol."
                }, 
                {
                    "text": "Import Hungry Fish’s costume, **resources/hungry-fish.png** then remove its existing **costume1** and **costume2**."
                }, 
                {
                    "text": "Click on the blue '**i**' symbol again,  and make sure the sprite can only flip left-right."
                }, 
                {
                    "blocks": "when FLAG clicked\n        forever\n            point towards [mouse pointer v]\n            move (3) steps", 
                    "text": "Now create a script for Hungry Fish to follow the mouse around the sea like this:"
                }
            ], 
            "description": "**Let’s make the Hungry Fish swim around the sea!**", 
            "extensions": [
                {
                    "text": "+ If you want, you can put different numbers in the script. How does that change how Hungry Fish moves?"
                }, 
                {
                    "text": "Change the distance threshold to a large number (e.g. 100), or a small number (e.g. 1)."
                }, 
                {
                    "text": "Change the amount the fish moves to a large number (e.g. 20) or a small number (e.g. 1 or even 0)."
                }
            ], 
            "number": "1", 
            "tests": [
                {
                    "text": "Click the green flag."
                }, 
                {
                    "text": "Move the mouse pointer around the sea. Does the fish follow the pointer?"
                }, 
                {
                    "text": "What happens if you don’t move the mouse pointer and the fish catches up with it? What does it look like? Why does it do this?"
                }, 
                {
                    "blocks": "when FLAG clicked\n        forever\n            if <(distance to [mouse-pointer v]) > (10)> then\n                point towards [mouse-pointer v]\n                move (3) steps", 
                    "text": "You can stop the Hungry Fish flipping like crazy if you make it only move when it’s not too near the mouse pointer (The `distance to` block is in the `Sensing` palette)."
                }
            ], 
            "title": "Create a sprite that follows the mouse"
        }, 
        {
            "components": [
                {
                    "text": "+ Create a new sprite from the library, using **Animals/starfish**."
                }, 
                {
                    "text": "Use the `Shrink` sprite tool (above the Stage) to make the sprite smaller."
                }, 
                {
                    "blocks": "when FLAG clicked\n        forever\n            move (2) steps\n            turn right (pick random (-20) to (20)) degrees\n            if on edge, bounce", 
                    "text": "Create a script to make the prey swim around. We want them to move randomly, so let’s make it move forward a bit, then turn a random amount left or right, then do it again."
                }
            ], 
            "description": "It's time to make something for the Hungry Fish to try to eat!", 
            "extensions": [
                {
                    "text": "+ Try changing the numbers in the `pick random` and move blocks. How do they make the prey move differently?"
                }, 
                {
                    "text": "What does the `if on edge, bounce` block do? Take it out and see what happens."
                }
            ], 
            "number": "2", 
            "tests": [
                {
                    "text": "Click the green flag and watch the prey swim around. Does it swim like you expect? Does it swim realistically?\n\nAt the moment, the Hungry Fish and the prey don’t interact with each other. We’ll sort that out in the next step."
                }
            ], 
            "title": "Add some prey"
        }, 
        {
            "components": [
                {
                    "blocks": "forever\n\t\tmove (2) steps\n\t\tturn right (pick random (-20) to (20)) degrees\n\t\tif on edge, bounce\n\t\tif <touching [Hungry Fish v]?> then\n\t\t\thide\n\t\t\twait (3) secs\n\t\t\tshow", 
                    "text": "+ First, let’s make the prey disappear if it is touching the Hungry Fish, and then reappear 3 seconds later. Use the `touching` block to see if it is touching the fish."
                }
            ], 
            "description": "Now we want to make the Hungry Fish eat the prey! Once the Hungry Fish has caught the prey in its mouth, two things need to happen:\n\n* The Hungry Fish needs to close its mouth and make a \"chomp\" sound.\n* The prey needs to disappear, then reappear a short while later.", 
            "number": "3", 
            "tests": [
                {
                    "text": "Click the green flag."
                }, 
                {
                    "text": "Does the Hungry Fish eat the prey? Does it eat each of the different prey?"
                }
            ], 
            "title": "Hungry Fish eats the prey"
        }, 
        {
            "challenge": true, 
            "components": [
                {
                    "text": "Pick one of the prey to experiment on. If they have the same costumes, make it a different colour with the `set color effect` block. That way, you can tell it apart from the rest of the prey.\n\nMake this prey move slower than the others. **Hint"
                }
            ], 
            "description": "At the moment, all the prey move in the same way. Can you make one of them move differently? **Hint:** Don’t spend too long on this bit without looking at the other activities in this project.", 
            "number": "1", 
            "title": "Make the prey move differently"
        }, 
        {
            "challenge": true, 
            "components": [
                {
                    "text": "There’s no block in Scratch that tells you the direction that another sprite is in. But you can make one sprite point towards another, then make it turn around to face away. The blocks you need are in the `Motion` palette.\n\nUsing that idea, make one of the prey always point away from the Hungry Fish.\n\nYou might find that your prey gets stuck in the corner if it is always swimming away from the fish. You might want to have the prey only try to escape when the fish gets close. **Hint"
                }
            ], 
            "description": "The prey in this game are really stupid! They just swim around randomly until they’re eaten. Real prey swim away from predators. Let’s make one of the prey swim away from the Hungry Fish.", 
            "number": "2", 
            "title": "Make the prey avoid the Hungry Fish"
        }, 
        {
            "challenge": true, 
            "components": [
                {
                    "text": "Where should you put the block that changes the score?\n\nMake sure the score goes back to zero at the start of the game. Where should you put that block?"
                }
            ], 
            "description": "It’s not enough just to eat lobsters. How do you know you’re better at the game than your friends? You need a way to keep score so lets add a score board. Look at the **Keep Score scratch card** for an idea of how to do it.", 
            "number": "3", 
            "title": "Add a score"
        }, 
        {
            "challenge": true, 
            "components": [
                {
                    "text": "Look at the **Timer scratch card** for how to add a timer to the game. Start with the game lasting thirty seconds."
                }
            ], 
            "description": "Give yourself a time limit in the game. How many prey can you eat in thirty seconds?", 
            "number": "4", 
            "title": "Add a countdown"
        }, 
        {
            "challenge": true, 
            "components": [
                {
                    "text": "**Hint"
                }
            ], 
            "description": "Award a large bonus score if you can eat all three lobsters at the same time. How can you tell how many prey have been eaten?", 
            "number": "5", 
            "title": "Add a bonus score"
        }, 
        {
            "challenge": true, 
            "components": [
                {
                    "text": "Modify the game so that, instead of you controlling a fish that tries to eat the others, you control one prey in a sea with lots of Hungry Fish. How long can you last before you’re eaten? Instead of having a score, how about giving the prey 3 lives and ending the game when they're all gone?"
                }
            ], 
            "description": "Sometimes, you can have great new ideas by taking an existing idea and doing the opposite.", 
            "number": "6", 
            "title": "Change the game: keep a prey alive!"
        }
    ], 
    "title": "Fish Chomp"
}